# BadFaceFoundInDwg Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..BadFaceFoundInDwg Property
BuiltInFailures..::..ImportFailures Class See Also
---
One or more hatch regions were found in the imported file with unconnected boundaries. These hatch regions will be ignored.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadFaceFoundInDwg { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadFaceFoundInDwg As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadFaceFoundInDwg {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace